Yr8/8-CS-AI/pages/LessonPlan.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Artificial Intelligence</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">Artificial Intelligence</h1>
<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1">Lesson Plan - Week 5</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 learn">
<h3 id="sec-1-1">Context and Students</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>8G Computing - AI
</li>
<li>Students have been learning about the past, present and future state of Artificial Intelligence.
</li>
<li>This lesson is based upon a student's question regarding ethical choices Google's self-driving cars may have to make.
</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="left">Boys</td>
<td class="right">15</td>
</tr>

<tr>
<td class="left">Girls</td>
<td class="right">15</td>
</tr>

<tr>
<td class="left">SEN</td>
<td class="right">Tom(Hearing Impaired), Ali(STT Inv)</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3 learn">
<h3 id="sec-1-2">Starter - 5 Minutes</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Students can log-on and access bournetolearn to review previous assessments.
</li>
<li>Each students has a mini whiteboard.
</li>
<li><a href="threeQs.html">Display three questions on board</a> - students to note down their opinions.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3 learn">
<h3 id="sec-1-3">The Trolley Problem and Self Driving Cars - 15 minutes</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Show the students<a href="3Laws.html"> Asimov's three laws of robotics</a>.
</li>
<li>They can then have a couple of minutes to decide if these are enough to protect humans from AIs or if other laws need adding.
</li>
<li>Talk through the ethical dilemma of<a href="trolley.html"> <i>The Trolley Problem</i>.</a>
</li>
<li>Students can then write down on their whiteboards what choice they would make - give time to discuss as a class.
</li>
<li>Talk through the alternate Trolley problems, then discuss what an AI should do if given the choice - what should it's programming dictate.
</li>
<li>Talk through issues with 'Protecting Humanity and the greater good'
</li>
<li>Students complete Silver Task
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3 learn">
<h3 id="sec-1-4">Killer Robots - 15 minutes</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Discuss why planes have guided missiles and why the United States uses remote controlled unmanned drones.
</li>
<li><a href="sentry.html">Talk about and show image of South Korea's Sentry Gun</a> - explain the term autonomous.
</li>
<li>Is it right to create machines that are designed to take human life?
</li>
<li>Is it better to risk a few million pounds worth of equipment rather than putting the life of a soldier at risk?
</li>
<li>Students complete Gold Task
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3 learn">
<h3 id="sec-1-5">Robot Rights - 15 minutes</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Discuss Animal rights historically - 
</li>
<li><a href="https://www.youtube.com/watch?v=01MUrNMJmqQ&feature=youtu.be">Show the video of Kara</a> if there is enough time.
</li>
<li>Discuss the possibility of a needed charter on Robot rights.
</li>
<li>Students complete Platinum Task
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3 learn">
<h3 id="sec-1-6">Plenary</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>Display the<a href="threeQs.html"> three questions again</a>
</li>
<li>Have any of the students changed their minds?
</li>
<li>Do any of them have doubts about their earlier decisions.
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
